ThingPulse/esp32-icon64-ESPTeamsPresence/src/main.cpp
// Statemachine
#define SMODEINITIAL 0               // Initial
#define SMODEWIFICONNECTING 1        // Wait for wifi connection
#define SMODEWIFICONNECTED 2         // Wifi connected
#define SMODEDEVICELOGINSTARTED 10   // Device login flow was started
#define SMODEDEVICELOGINFAILED 11    // Device login flow failed
#define SMODEAUTHREADY 20            // Authentication successful
#define SMODEPOLLPRESENCE 21         // Poll for presence
#define SMODEREFRESHTOKEN 22         // Access token needs refresh
#define SMODEPRESENCEREQUESTERROR 23 // Access token needs refresh
uint8_t state = SMODEINITIAL;
uint8_t laststate = SMODEINITIAL;
static unsigned long tsPolling = 0;
uint8_t retries = 0;

// Multicore
TaskHandle_t TaskNeopixel; 


/**
 * Helper
 */
// Calculate token lifetime
int getTokenLifetime() {
	return (expires - millis()) / 1000;
}

// Save context information to file in SPIFFS
void saveContext() {
	const size_t capacity = JSON_OBJECT_SIZE(3) + 5000;
	DynamicJsonDocument contextDoc(capacity);
	contextDoc["access_token"] = access_token.c_str();
	contextDoc["refresh_token"] = refresh_token.c_str();
	contextDoc["id_token"] = id_token.c_str();

	File contextFile = SPIFFS.open(CONTEXT_FILE, FILE_WRITE);
	size_t bytesWritten = serializeJsonPretty(contextDoc, contextFile);
	contextFile.close();
	DBG_PRINT(F("saveContext() - Success: "));
	DBG_PRINTLN(bytesWritten);
	// DBG_PRINTLN(contextDoc.as<String>());
}

boolean loadContext() {
	File file = SPIFFS.open(CONTEXT_FILE);
	boolean success = false;

	if (!file) {
		DBG_PRINTLN(F("loadContext() - No file found"));
	} else {
		size_t size = file.size();
		if (size == 0) {
			DBG_PRINTLN(F("loadContext() - File empty"));
		} else {
			const int capacity = JSON_OBJECT_SIZE(3) + 10000;
			DynamicJsonDocument contextDoc(capacity);
			DeserializationError err = deserializeJson(contextDoc, file);

			if (err) {
				DBG_PRINT(F("loadContext() - deserializeJson() failed with code: "));
				DBG_PRINTLN(err.c_str());
			} else {
				int numSettings = 0;
				if (!contextDoc["access_token"].isNull()) {
					access_token = contextDoc["access_token"].as<String>();
					numSettings++;
				}
				if (!contextDoc["refresh_token"].isNull()) {
					refresh_token = contextDoc["refresh_token"].as<String>();
					numSettings++;
				}
				if (!contextDoc["id_token"].isNull()){
					id_token = contextDoc["id_token"].as<String>();
					numSettings++;
				}
				if (numSettings == 3) {
					success = true;
					DBG_PRINTLN(F("loadContext() - Success"));
					if (strlen(paramClientIdValue) > 0 && strlen(paramTenantValue) > 0) {
						DBG_PRINTLN(F("loadContext() - Next: Refresh token."));
						state = SMODEREFRESHTOKEN;
					} else {
						DBG_PRINTLN(F("loadContext() - No client id or tenant setting found."));
					}
				} else {
					Serial.printf("loadContext() - ERROR Number of valid settings in file: %d, should be 3.\n", numSettings);
				}
				// DBG_PRINTLN(contextDoc.as<String>());
			}
		}
		file.close();
	}

	return success;
}

// Remove context information file in SPIFFS
void removeContext() {
	SPIFFS.remove(CONTEXT_FILE);
	DBG_PRINTLN(F("removeContext() - Success"));
}

void startMDNS() {
	DBG_PRINTLN("startMDNS()");
	// Set up mDNS responder
    if (!MDNS.begin(thingName)) {
        DBG_PRINTLN("Error setting up MDNS responder!");
        while(1) {
            delay(1000);
        }
    }
	// MDNS.addService("http", "tcp", 80);

    DBG_PRINT("mDNS responder started: ");
    DBG_PRINT(thingName);
    DBG_PRINTLN(".local");
}


#include "request_handler.h"
#include "spiffs_webserver.h"


// Neopixel control
void setAnimation(uint8_t segment, uint8_t mode = FX_MODE_STATIC, uint32_t color = RED, uint16_t speed = 3000, bool reverse = false) {
	uint16_t startLed, endLed = 0;

	// Support only one segment for the moment
	if (segment == 0) {
		startLed = 0;
		endLed = numberLeds;
	}
	Serial.printf("setAnimation: %d, %d-%d, Mode: %d, Color: %d, Speed: %d\n", segment, startLed, endLed, mode, color, speed);
	ws2812fx.setSegment(segment, startLed, endLed, mode, color, speed, reverse);
}

void setPresenceAnimation() {
	// Activity: Available, Away, BeRightBack, Busy, DoNotDisturb, InACall, InAConferenceCall, Inactive, InAMeeting, Offline, OffWork, OutOfOffice, PresenceUnknown, Presenting, UrgentInterruptionsOnly

	// if (activity.equals("Available")) {
	// 	setAnimation(0, FX_MODE_STATIC, GREEN);
	// }
	// if (activity.equals("Away")) {
	// 	setAnimation(0, FX_MODE_STATIC, YELLOW);
	// }
	// if (activity.equals("BeRightBack")) {
	// 	setAnimation(0, FX_MODE_STATIC, ORANGE);
	// }
	// if (activity.equals("Busy")) {
	// 	setAnimation(0, FX_MODE_STATIC, PURPLE);
	// }
	// if (activity.equals("DoNotDisturb") || activity.equals("UrgentInterruptionsOnly")) {
	// 	setAnimation(0, FX_MODE_STATIC, PINK);
	// }
	// if (activity.equals("InACall")) {
	// 	setAnimation(0, FX_MODE_BREATH, RED);
	// }
	// if (activity.equals("InAConferenceCall")) {
	// 	setAnimation(0, FX_MODE_BREATH, RED, 9000);
	// }
	// if (activity.equals("Inactive")) {
	// 	setAnimation(0, FX_MODE_BREATH, WHITE);
	// }
	// if (activity.equals("InAMeeting")) {
	// 	setAnimation(0, FX_MODE_SCAN, RED);
	// }	
	// if (activity.equals("Offline") || activity.equals("OffWork") || activity.equals("OutOfOffice") || activity.equals("PresenceUnknown")) {
	// 	setAnimation(0, FX_MODE_STATIC, BLACK);
	// }
	// if (activity.equals("Presenting")) {
	// 	setAnimation(0, FX_MODE_COLOR_WIPE, RED);
	// }


	// We don't want those who look at the presence device having to remember a large number of color/animation combinations.
	// Instead, we want to only display the same familiar but very basic traffic light that MS Teams uses.
	// Green: 	Available, 
	// Yellow: 	Away, BeRightBack, 
	// Red: 	Busy, InACall, InAMeeting, Presenting, DoNotDisturb, InAConferenceCall, UrgentInterruptionsOnly
	// Black: 	everything else i.e. Inactive, Offline, OffWork, OutOfOffice, PresenceUnknown 
	
	if (activity.equals("Available")) {
		setAnimation(0, FX_MODE_STATIC, GREEN);
	} else if (activity.equals("Away") || 
			   activity.equals("BeRightBack")) {
				// the MS Teams yellow/orange appears to be something like 0xFCAC12
		setAnimation(0, FX_MODE_STATIC, (uint32_t)0xFCAC12);
	} else if (activity.equals("Busy") || 
	           activity.equals("InACall") || 
			   activity.equals("InAMeeting") || 
			   activity.equals("Presenting") ||
			   activity.equals("DoNotDisturb") ||
			   activity.equals("InAConferenceCall") ||
			   activity.equals("UrgentInterruptionsOnly")) {
		setAnimation(0, FX_MODE_COLOR_WIPE, RED);
	} else {
		setAnimation(0, FX_MODE_STATIC, BLACK);
	}
}


/**
 * Application logic
 */

// Handler: Wifi connected
void onWifiConnected() {
	state = SMODEWIFICONNECTED;
}

// Poll for access token
void pollForToken() {
	String payload = "client_id=" + String(paramClientIdValue) + "&grant_type=urn:ietf:params:oauth:grant-type:device_code&device_code=" + device_code;
	Serial.printf("pollForToken()\n");

	// const size_t capacity = JSON_ARRAY_SIZE(1) + JSON_OBJECT_SIZE(7) + 530; // Case 1: HTTP 400 error (not yet ready)
	const size_t capacity = JSON_OBJECT_SIZE(7) + 10000; // Case 2: Successful (bigger size of both variants, so take that one as capacity)
	DynamicJsonDocument responseDoc(capacity);
	boolean res = requestJsonApi(responseDoc, "https://login.microsoftonline.com/" + String(paramTenantValue) + "/oauth2/v2.0/token", payload, capacity);

	if (!res) {
		state = SMODEDEVICELOGINFAILED;
	} else if (responseDoc.containsKey("error")) {
		const char* _error = responseDoc["error"];
		const char* _error_description = responseDoc["error_description"];

