ThingPulse/esp32-icon64-ESPTeamsPresence/src/main.cpp
	// WS2812FX
	ws2812fx.init();
	rmt_tx_int(RMT_CHANNEL_0, ws2812fx.getPin());
	ws2812fx.start();
	setAnimation(0, FX_MODE_STATIC, WHITE);

	// iotWebConf - Initializing the configuration.
	// work around the unintuitive default value handling before iotWebConf 3.x (manually copy default values into buffers)
	strncpy(paramClientIdValue, DEFAULT_AZURE_CLIENT_ID, STRING_LEN);
	strncpy(paramPollIntervalValue, DEFAULT_POLLING_PRESENCE_INTERVAL, INTEGER_LEN);
	strncpy(paramNumLedsValue, String(NUMLEDS).c_str(), INTEGER_LEN);
	// END workaround
	#ifdef LED_BUILTIN
	iotWebConf.setStatusPin(LED_BUILTIN);
	#endif
	iotWebConf.setWifiConnectionTimeoutMs(5000);
	iotWebConf.addParameter(&separator);
	iotWebConf.addParameter(&paramClientId);
	iotWebConf.addParameter(&paramTenant);
	iotWebConf.addParameter(&paramPollInterval);
	// not needed as number of LEDs is given for the Icon64
	// iotWebConf.addParameter(&paramNumLeds);
	// iotWebConf.setFormValidator(&formValidator);
	// iotWebConf.getApTimeoutParameter()->visible = true;
	// iotWebConf.getApTimeoutParameter()->defaultValue = "10";
	iotWebConf.setWifiConnectionCallback(&onWifiConnected);
	iotWebConf.setConfigSavedCallback(&onConfigSaved);
	// We do not support OTA
	// iotWebConf.setupUpdateServer(&httpUpdater);
	iotWebConf.skipApStartup();
	iotWebConf.init();

	// WS2812FX
	numberLeds = atoi(paramNumLedsValue);
	if (numberLeds < 1) {
		DBG_PRINTLN(F("Number of LEDs not given, using 16."));
		numberLeds = NUMLEDS;
	}
	ws2812fx.setLength(numberLeds);
	ws2812fx.setCustomShow(customShow);

	// HTTP server - Set up required URL handlers on the web server.
	server.on("/", HTTP_GET, handleRoot);
	server.on("/config", HTTP_GET, [] { iotWebConf.handleConfig(); });
	server.on("/config", HTTP_POST, [] { iotWebConf.handleConfig(); });
	server.on("/upload", HTTP_GET, [] { handleMinimalUpload(); });
	server.on("/api/startDevicelogin", HTTP_GET, [] { handleStartDevicelogin(); });
	server.on("/api/settings", HTTP_GET, [] { handleGetSettings(); });
	server.on("/api/clearSettings", HTTP_GET, [] { handleClearSettings(); });
	server.on("/fs/delete", HTTP_DELETE, handleFileDelete);
	server.on("/fs/list", HTTP_GET, handleFileList);
	server.on("/fs/upload", HTTP_POST, []() {
		server.send(200, "text/plain", "");
	}, handleFileUpload);

	// server.onNotFound([](){ iotWebConf.handleNotFound(); });
	server.onNotFound([]() {
		iotWebConf.handleNotFound();
		if (!handleFileRead(server.uri())) {
			server.send(404, "text/plain", "FileNotFound");
		}
	});

	DBG_PRINTLN(F("setup() ready..."));

	// SPIFFS.begin() - Format if mount failed
	DBG_PRINTLN(F("SPIFFS.begin() "));
	if(!SPIFFS.begin(true)) {
		DBG_PRINTLN("SPIFFS Mount Failed");
        return;
    }

	// Pin neopixel logic to core 0
	xTaskCreatePinnedToCore(
		neopixelTask,
		"Neopixels",
		1000,
		NULL,
		1,
		&TaskNeopixel,
		0);
}

void loop()
{
	// iotWebConf - doLoop should be called as frequently as possible.
	iotWebConf.doLoop();

	statemachine();

	if (digitalRead(BUTTON_PIN) == LOW) {
		DBG_PRINTLN("Restarting device");
  		ESP.restart();
	}
}
